"""
機械翻訳のデータセットをダウンロードせよ．
訓練データ，開発データ，評価データを整形し，必要に応じてトークン化などの前処理を行うこと．
ただし，この段階ではトークンの単位として形態素（日本語）および単語（英語）を採用せよ．
"""
# トークン化されているファイルを開く
languages=["en","ja"]
types=["dev","test","train"]
for type in types:
    for language in languages:
        r_file=open(f"../kftt-data-1.0/data/tok/kyoto-{type}.{language}","r")
        if type=="test":
            reader=r_file.readlines()[1:]
        else:
            reader=r_file.readlines()
        print(f"-----{type}/{language}-----")
        print(reader[0].split(" "))
        print("----------------------------")

"""
-----dev/en-----
['Rinzai', 'Zen', 'Buddhism', 'is', 'one', 'of', 'the', 'Chinese', 'five', 'Houses', '/', 'seven', 'Schools', 'of', 'Zen', '(', 'Rinzai', ',', 'Igyou', ',', 'Soto', ',', 'Unmon', ',', 'Hogan', ')', 'and', 'Gigen', 'RINZAI', '(', '?', '-', '867', ')', 'of', 'Tang', 'was', 'its', 'founder', '.\n']
----------------------------
-----dev/ja-----
['臨済', '宗', '（', '臨濟', '宗', '、', 'りんざい', 'しゅう', '）', 'は', '、', '中国', '禅', '五', '家', '七', '宗', '（', 'ご', 'け', 'しち', 'しゅう', '）', '（', '臨済', '、', '潙仰', '宗', '、', '曹洞', '宗', '、', '雲門', '宗', '、', '法眼', '宗', '）', 'の', 'ひと', 'つ', 'で', '、', '唐', 'の', '臨済', '義', '玄', '（', '？', '-867', '年', '）', 'を', '宗祖', 'と', 'する', '。\n']
----------------------------
-----test/en-----
['Dogen', 'was', 'a', 'Zen', 'monk', 'in', 'the', 'early', 'Kamakura', 'period', '.\n']
----------------------------
-----test/ja-----
['道元', '（', 'どうげん', '）', 'は', '、', '鎌倉', '時代', '初期', 'の', '禅僧', '。\n']
----------------------------
-----train/en-----
['Known', 'as', 'Sesshu', '(', '1420', '-', '1506', ')', ',', 'he', 'was', 'an', 'ink', 'painter', 'and', 'Zen', 'monk', 'active', 'in', 'the', 'Muromachi', 'period', 'in', 'the', 'latter', 'half', 'of', 'the', '15th', 'century', ',', 'and', 'was', 'called', 'a', 'master', 'painter', '.\n']
----------------------------
-----train/ja-----
['雪舟', '（', 'せっしゅう', '、', '1420', '年', '（', '応永', '27', '年', '）', '-', '1506', '年', '（', '永正', '3', '年', '）', '）', 'は', '号', 'で', '、', '15', '世紀', '後半', '室町', '時代', 'に', '活躍', 'し', 'た', '水墨', '画', '家', '・', '禅僧', 'で', '、', '画聖', 'と', 'も', '称え', 'られ', 'る', '。\n']
----------------------------
"""